const infoWindowSetting = {
  name: '弹出框位置',
  key: 'infoWindowSetting',
  items: [{
    label: '上弹出框距左侧px',
    type: 'panel-input',
    value: 200
  }, {
    label: '下弹出框距右侧px',
    type: 'panel-input',
    value: 80
  }]
}

const setting = {
  title: '在途信息',
  width: 980,
  height: 560,
  version: 2,
  config: [infoWindowSetting],
  data: {
    headerRows: 1,
    headerCols: 1,
    data: [
      ['记录', '起点', '终点', '发出时间', '到达时间', '项目名称', '状态'],
      ['1', '广州市', '清远市', '2019-12-13 10:12:20', '2019-12-15 23:34:45', '这是一个很长的项目名称，大概有二十多个字吱吱吱吱吱吱吱吱吱吱吱11', '运输中'],
      ['2', '广州市', '常熟市', '2019-12-13 11:12:20', '2019-12-16 23:34:45', '这是一个很长的项目名称，大概有二十多个字字吱吱吱吱吱吱吱吱吱吱吱22', '运输中'],
      ['3', '广州市', '龙口市', '2019-12-13 12:12:20', '2019-12-17 23:34:45', '这是一个很长的项目名称，大概有二十多个字33', '运输中'],
      ['4', '广州市', '达州市', '2019-12-13 13:12:20', '2019-12-18 23:34:45', '这是一个很长的项目名称，大概有二十多个字44', '运输中'],
      ['5', '广州市', '南京市', '2019-12-13 14:12:20', '2019-12-19 23:34:45', '这是一个很长的项目名称，大概有二十多个字55', '运输中'],
      ['6', '广州市', '宜州市', '2019-12-13 15:12:20', '2019-12-20 23:34:45', '这是一个很长的项目名称，大概有二十多个字66', '运输中'],
      ['7', '广州市', '沅江市', '2019-12-13 16:12:20', '2019-12-21 23:34:45', '这是一个很长的项目名称，大概有二十多个字77', '运输中'],
      ['8', '广州市', '确山市', '2019-12-13 17:12:20', '2019-12-22 23:34:45', '这是一个很长的项目名称，大概有二十多个字88', '运输中'],
      ['9', '广州市', '石河子市', '2019-12-13 18:12:20', '2019-12-23 23:34:45', '这是一个很长的项目名称，大概有二十多个字99', '运输中'],
      ['10', '广州市', '泉州市', '2019-12-13 19:12:20', '2019-12-24 23:34:45', '这是一个很长的项目名称，大概有二十多个字10', '运输中'],
      ['11', '广州市', '深圳市', '2019-12-13 20:12:20', '2019-12-25 23:34:45', '这是一个很长的项目名称，大概有二十多个字11', '运输中'],
      ['12', '广州市', '三明市', '2019-12-13 21:12:20', '2019-12-26 23:34:45', '这是一个很长的项目名称，大概有二十多个字12', '运输中'],
      ['13', '广州市', '青岛市', '2019-12-13 22:12:20', '2019-12-27 23:34:45', '这是一个很长的项目名称，大概有二十多个字13', '运输中'],
      ['14', '广州市', '水富市', '2019-12-13 23:12:20', '2019-12-28 23:34:45', '这是一个很长的项目名称，大概有二十多个字14', '运输中']
    ]
  }
}

export default setting
